app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(school_class_params(:title, :room_number))
    @school_class.title = params[:title]
    @school_class.room_number = params[:room_number]
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-09-17 18:20:20.478604"], ["updated_at", "2019-09-17 18:20:20.478604"]]