app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params(:first_name, :last_name))
    # @student.first_name = params[:first_name]
    # @student.last_name = params[:last_name]
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-09-17 18:21:17.240850"], ["updated_at", "2019-09-17 18:21:17.240850"]]